Revit 2026 API

# UVCrossProduct Method

---

The cross product of this 2-D vector and the specified 2-D vector.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double CrossProduct(
	UV source
)
```
```vb
Public Function CrossProduct (
	source As UV
) As Double
```
```cpp
public:
double CrossProduct(
	UV^ source
)
```
```fsharp
member CrossProduct :
        source : UV -> float
```

#### Parameters

source UV
    The vector to multiply with this vector.

#### Return Value

DoubleThe real number equal to the cross product.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when source is . |

The cross product of the two vectors in 2-D space is equivalent to the area of the parallelogram they span.

#### Reference

UV Class

Autodesk.Revit.DB Namespace